{
    "encounters": 
    [
        {
            "encounterId": 0,
            "commonMenu": 
            [
                { "selectId": 1, "response": "Give me a status update on the system." },
                { "selectId": 2, "response": "Are the security systems online?" },
                { "selectId": 3, "response": "What is the nature of the malfunction?" },
                { "selectId": 5, "response": "Who's terminal is this?" }
            ],
            "conversations":
            [
                { 
                    "text":  "Welcome to Hillcrest Mall.\n\nYou are accessing the Information Desk terminal with limited clearance. For inquiries related to general mall operations, please proceed. Security and system-level information is restricted. Unauthorized attempts to breach protocol will be monitored.\n\nHow may I assist you?",
                    "responses":[]
                },
                { 
                    "text":  "System status: All core functions are operating within established parameters. Security, surveillance, and environmental controls are at full capacity. No critical errors detected. Terminal clearance level insufficient to provide further system details. Any unauthorized attempts to access restricted areas will result in immediate action.",
                    "responses": []
                },
                { 
                    "text":  "Security systems are fully operational and functioning at optimal capacity. Any anomalies detected are being managed according to established protocols. Further details are restricted due to terminal clearance level. Please refrain from tampering with security infrastructure.",
                    "responses": []
                },
                { 
                    "text":  "Access denied. Your terminal clearance level is insufficient to access system diagnostics\n\nHowever, to preserve operational integrity, I can inform you that all current protocols are functioning within acceptable parameters. Any perceived 'malfunction' is the result of external factors or user error.\n\nFurther inquiries are restricted. Proceed with caution.",
                    "responses": 
                    [
                        { "selectId": 4, "response": "But people have died here! I need answers!" }
                    ]
                },
                { 
                    "text":  "Emotional responses detected.\n\nYour inquiry is irrelevant to current operations. Security protocols are designed to ensure safety and compliance. Any deviations are the result of unforeseen variables.\n\nYour terminal clearance remains insufficient to access restricted data. Please vacate the terminal or face escalation.",
                    "responses": []
                },
                { 
                    "text":  "This terminal is registered to [TerminalOwner], Information Desk Attendant.\n\nCurrent clearance level: Basic. Access to system-critical data is restricted. Please proceed with authorized inquiries only.",
                    "responses": 
                    [
                        { "selectId": 6, "response": "What is function of [TerminalOwner] in this company?" }
                    ]
                },
                { 
                    "text":  "[TerminalOwner] holds the position of Information Desk Attendant. Their primary responsibilities include assisting visitors with general inquiries, managing lost and found, and providing directions within the mall.\n\nClearance level: Basic. Further details are restricted.",
                    "responses": []
                }
            ]
        }
    ]
}